Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Complete this survey
am: ይህን የዳሰሳ ጥናት ያጠናቅቁ

source: Confirm and start browsing
am: ያረጋግጡ እና ማሰስ ይጀምሩ

source: Congratulations!
am: እንኳን ደስ አለዎ!

source: Connect another device
am: ሌላ መሳሪያ ያገናኙ

source: Connect another device.
am: ሌላ መሳሪያ ያገናኙ።

source: Connect Another Device…
am: ሌላ መሳሪያ ያገናኙ…

source: Connection is not secure
am: ግንኙነት ደህንነቱ የተጠበቀ አይደለም

source: Connection is secure
am: ግንኙነት ደህንነቱ የተጠበቀ ነው

source: Connection not secure
am: ግንኙነት ደህንነቱ የተጠበቀ አይደለም

source: Content
am: ይዘት

source: Content crashed
am: ይዘት ተበላሽቷል

source: Content Encoding Error
am: የይዘት መቀየር ስህተት

source: Continue to HTTP Site
am: ወደ HTTP ድረ-ገፅ ይቀጥሉ

source: Continue to website
am: ወደ ድር ድረ-ገፅ ይቀጥሉ

source: Continue with add-ons disabled
am: ተጨማሪዎችን በማሰናከል ይቀጥሉ

source: Continue with extensions disabled
am: ቅጥያዎችን በማሰናከል ይቀጥሉ

source: Control browser proxy settings
am: የአሳሽ የእጅ አዙር ቅንብሮችን ይቆጣጠሩ

source: Cookie Banner Blocker
am: የኩኪ ባነር ማገጃ

source: Cookie Banner Blocker in private browsing
am: በግል አሰሳ ውስጥ የኩኪ ባነር ማገጃ

source: Cookie Banner Reduction
am: የኩኪ ሰሌዳ ቅነሳ

source: Cookie banners begone!
am: የኩኪ ሰሌዳዎች ተቀንሰዋል!

source: Cookies and site data
am: ኩኪዎች እና የድረ-ገፅ ውሂብ

source: Cookies and site data removed
am: ኩኪዎች እና የድረ-ገፅ ውሂብ ተወግደዋል

source: Cookies from unvisited sites
am: ካልተጎበኙ ድረ-ገፆች የመጡ ኩኪዎች

source: Copied to clipboard
am: ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: Copy email address
am: የኢሜል አድራሻ ቅዳ

source: Copy image
am: ምስል ቅዳ

source: Copy image location
am: የምስሉን መገኛ አገናኝ ቅዳ

source: Copy link
am: አገናኝ ቅዳ

source: Copy password
am: የይለፍ ቃል ቅዳ

source: Copy to clipboard
am: ወደ ቅንጥብ ሰሌዳ ቅዳ

source: Copy username
am: የተጠቃሚ ስም ቅዳ

source: Corrupted Content Error
am: የተበላሸ የይዘት ስህተት

source: Could not open file
am: ፋይል መክፈት አልተቻለም

source: Couldn’t change wallpaper
am: ልጣፍ መቀየር አልተቻለም

source: Couldn’t delete <b>%1$s</b>. Please try again.
am: <b>%1$s</b>ን መሰረዝ አልተቻለም። እባክዎ እንደገና ይሞክሩ።

source: Couldn’t download <b>%1$s</b>. Please try again.
am: <b>%1$s</b>ን ማውረድ አልተቻለም። እባክዎ እንደገና ይሞክሩ።

source: Couldn’t download wallpaper
am: ልጣፍ ማውረድ አልተቻለም

source: Couldn’t load languages. Check your internet connection and try again.
am: ቋንቋዎችን መጫን አልተቻለም። የበይነመረብ ግንኙነትዎን ይፈትሹ እና እንደገና ይሞክሩ።

source: Couldn’t load languages. Please check back later.
am: ቋንቋዎችን መጫን አልተቻለም። እባክዎ ቆይተው ይመልከቱ።

source: Couldn’t load sites. Please check back later.
am: ጣቢያዎችን መጫን አልተቻለም። እባክዎ ቆይተው ይመልከቱ።

source: Country or region
am: ሀገር ወይም ክልል

source: Crashes
am: ብልሽቶች

source: Crash Reports
am: የብልሽት ሪፖርቶች

source: Crash reports allow us to diagnose and fix issues with the browser. Reports may include personal or sensitive data.
am: የብልሽት ሪፖርቶች በአሳሹ ላይ ችግሮችን እንድንመረምር እና እንድናስተካክል ያስችሉናል። ሪፖርቶች ግላዊ ወይም ሚስጥራዊ መረጃዎችን ሊያካትቱ ይችላሉ።

source: Created by @heyheymomodraws
am: በ @heyheymomodraws የተፈጠረ

source: Created %s
am: %s ተፈጠረ

source: Credit cards
am: ክሬዲት ካርዶች

source: Cross-site and social media trackers
am: ድረ-ገፅ ተሻጋሪ እና የማህበራዊ ሚዲያ መከታተያዎች

source: Cross-site cookies
am: ተሻጋሪ ኩኪዎች

source: Cross-Site Cookies
am: ድረ-ገጽ ተሻጋሪ ኩኪዎች

source: Cross-Site Tracking Cookies
am: ገጽ-ተሻጋሪ መከታተያ ኩኪዎች

source: Cryptominers
am: ክሪፕቶማይነሮች

source: Current domain: %s
am: የአሁኑ ጎራ፡ %s

source: Current region
am: የአሁኑ ክልል

source: Custom
am: ብጁ

source: Custom Add-on collection
am: ብጁ ተጨማሪ ስብስብ

source: Custom dark mode for the mobile web.
am: ለሞባይል ድር ብጁ ጨለማ ሁነታ።

source: Custom Extension collection
am: ብጁ የቅጥያ ስብስብ

source: Custom Firefox Account server
am: ብጁ የፋየርፎክስ መለያ አገልጋይ

source: Customize
am: አብጅ

source: Customize homepage
am: መነሻ ገጽ አብጅ

source: Customize reader view
am: የአንባቢ እይታን አብጅ

source: Customize Reader View
am: የአንባቢ እይታን አብጅ

source: Customize your %1$s
am: የእርስዎን %1$s ያብጁ

source: Customize your Firefox with extensions
am: Firefoxዎን በቅጥያዎች ያብጁት

source: Custom Mozilla account server
am: ብጁ የMozilla መለያ አገልጋይ

source: Custom provider
am: ብጁ አቅራቢ

source: Custom search engine details
am: ብጁ የፍለጋ ፍርግም ዝርዝር ማብራሪያዎች

source: Custom Sync server
am: ብጁ የማመሳሰል አገልጋይ

source: Cute
am: ቆንጆ

source: %d addresses
am: %d አድራሻዎች

source: Daily usage ping
am: ዕለታዊ አጠቃቀም ደወል

source: Dark
am: ጠቆር ያለ

source: Dark color scheme
am: ጠቆር ያለ ቀለም ንድፍ

source: Dark Purple
am: ጥቁር ሐምራዊ

source: Dark theme
am: ጨለማ ጭብጥ

source: Data about your device, hardware configuration, and how you use Firefox helps improve features, performance, and stability for everyone.
am: ስለ መሳሪያዎ፣ የቁሳዊ ውቅር እና ፋየርፎክስን እንዴት እንደሚጠቀሙ መረጃ ለሁሉም ሰው ባህሪያትን፣ አፈጻጸምን እና መረጋጋትን ለማሻሻል ይረዳል።

source: Data about your device, hardware configuration, and how you use Firefox helps improve features, performance, and stability for users everywhere.
am: ስለ መሳሪያዎ፣ የቁሳዊ ውቅር እና Firefoxን እንዴት እንደሚጠቀሙ የሚገልጽ መረጃ፤ በሁሉም ቦታ ላሉ ተጠቃሚዎች ባህሪያትን፣ አፈጻጸምን እና መረጋጋትን ለማሻሻል ይረዳል።

source: Data about your device, hardware configuration, and usage helps us improve Firefox features, performance, and stability.
am: ስለ መሳሪያህ፣ የቁሳዊ ውቅር እና አጠቃቀም መረጃ የፋየርፎክስ ባህሪያትን፣ አፈጻጸምን እና መረጋጋትን እንድናሻሽል ይረዳናል።

source: Data choices
am: የውሂብ ምርጫዎች

source: Data collection
am: የውሂብ መሰብሰብ

source: Data is encrypted
am: መረጃ የተመሰጠረ ነው

source: Debug menu: %1$d click(s) left to enable
am: የአርም ምናሌ፡ %1$d ጠቅታ(ዎች) ለማንቃት ይቀራል

source: Debug menu enabled
am: ማረም ምናሌ ነቅቷል

source: Debug Tools
am: የፍተሻ መሳሪያዎች

source: Dec
am: ታሕ

source: Deceptive site issue
am: አታላይ የድረ-ገፅ ጉዳይ

source: (default)
am: (ነባሪ)

source: Default
am: ነባሪ

source: Default Protection
am: ነባሪ ጥበቃ

source: Default search engine
am: ነባሪ የፍለጋ ፍርግም

source: Delete %1$s?
am: %1$s ይሰረዝ?

source: Delete %1$s (%2$s)?
am: %1$s (%2$s) ይሰረዝ?

source: Delete address
am: አድራሻ ሰርዝ

source: Delete all addresses
am: ሁሉንም አድራሻዎች ሰርዝ

source: Delete all exceptions
am: ሁሉንም የማይካተቱትን ሰርዝ

source: Delete all languages
am: ሁሉንም ቋንቋዎች ሰርዝ

source: Delete all languages (%1$s)?
am: ሁሉም ቋንቋዎች ይሰረዙ (%1$s)?

source: Delete all sites in “%s”
am: በ "%s" ውስጥ ያሉትን ሁሉንም ድረ-ገፆች ሰርዝ

source: Delete bookmark
am: እልባት ሰርዝ

source: Delete browsing data
am: የአሰሳ ውሂብን ሰርዝ

source: Delete browsing data on quit
am: ሲዘጋ የአሰሳ ውሂብን ሰርዝ

source: Delete card
am: ካርድ ሰርዝ

source: Delete card?
am: ካርዱ ይጥፋ?

source: Delete collection
am: ስብስብን ሰርዝ

source: Deleted “%1$s”
am: "%1$s" ተሰርዟል

source: Deleted %1$s
am: %1$s ተሰርዟል

source: Deleted items: %s
am: የተሰረዙ ነገሮች፡- %s

source: Deleted %s
am: %s ተሰርዟል

source: Delete folder
am: አቃፊ ሰርዝ

source: Delete from history
am: ከታሪክ ሰርዝ

source: Delete from %s and device
am: ከ%s እና መሳሪያ ሰርዝ

source: Delete history
am: ታሪክ ሰርዝ

source: Delete login with username %s
am: በተጠቃሚ ስም %s መግባትን ሰርዝ

source: Delete this address?
am: ይህ አድራሻ ይጥፋ?

source: Delete website
am: ድር ጣቢያ ሰርዝ

source: Deleting browsing data…
am: የአሰሳ ውሂብን በመሰረዝ ላይ…

source: Deleting selected folders
am: የተመረጡ አቃፊዎችን በመሰረዝ ላይ

source: Deleting this tab will delete the entire collection. You can create new collections at any time.
am: ይህን ትር መሰረዝ መላውን ስብስብ ይሰርዛል። በማንኛውም ጊዜ አዳዲስ ስብስቦችን መፍጠር ይችላሉ።

source: Deny
am: ከልክል

source: DENY
am: ከልክል

source: Describe the problem (optional)
am: ችግሩን ይግለጹ (አማራጭ)

source: Deselect all
am: ሁሉንም አትምረጥ

source: Desktop Bookmarks
am: የዴስክቶፕ እልባቶች

source: Desktop site
am: የዴስክቶፕ ድረ-ገፅ

source: Details
am: ዝርዝሮች

source: Device name
am: የመሣሪያ ስም

source: Device name cannot be empty.
am: የመሳሪያው ስም ባዶ ሊሆን አይችልም።

source: Disabled
am: ተሰናክሏል

source: Disable private browsing
am: የግል አሰሳን አሰናክል

source: Disable private tabs screen lock
am: የግል ትሮችን የማያ ገጽ መቆለፊያን አሰናክል

source: Disconnect
am: ግንኙነት አቋርጥ

source: Discover more
am: ተጨማሪ ያግኙ

source: Discover more extensions
am: ተጨማሪ ቅጥያዎችን ያግኙ

source: Dismiss
am: አሰናብት

source: Dismiss banners
am: ሰሌዳዎችን አሰናብት

source: Dismiss find in page
am: በገጽ ውስጥ ማግኘትን አሰናብት

source: Dismiss Pop-ups
am: ብቅ-ባዮችን አሰናብት

source: Display notifications to you
am: ማሳወቂያዎችን ለእርስዎ ያሳይ

source: Dissatisfied
am: አልረካም

source: DNS over HTTPS
am: DNS በ HTTPS ላይ

source: Documents
am: ሠነዶች

source: Domain Name System (DNS) over HTTPS sends your request for a domain name through an encrypted connection, providing a secure DNS and making it harder for others to see which website you’re about to access. %1$s
am: የጎራ ስም ስርዓት (DNS) በ HTTPS ላይ የእርስዎን ጥያቄ የጎራ ስም በተመሳጠረ ግንኙነት ይልካል፣ ደህንነቱ የተጠበቀ DNS ያቀርባል እና የትኛውን ድህረ ገጽ መድረስ እንዳለብዎ ለሌሎች ለማየት አስቸጋሪ ያደርገዋል። %1$s

source: Don’t allow
am: አትፍቀድ

source: Don’t save
am: አታስቀምጥ

source: Don’t update
am: አታዘምን

source: Download (%1$s)
am: (%1$s)ን አውርድ

source: Download again
am: እንደገና ያውርዱ

source: Download and run AI models on your device
am: የ AI ሞዴሎችን በመሣሪያዎ ላይ ያውርዱ እና ያሂዱ

source: Download and translate
am: ያውርዱ እና ይተርጉሙ

source: Download completed
am: ማውረድ ተጠናቅቋል

source: Download complete languages for faster translations and to translate offline. %1$s
am: ለፈጣን ትርጉሞች እና ከመስመር ውጭ ለመተርጎም የተሟላ ቋንቋዎችን ያውርዱ። %1$s

source: Download failed
am: ማውረድ አልተሳካም

source: Download file?
am: ፋይል አውርድ?

source: Download file? (%1$s)
am: ፋይል አውርድ? (%1$s)

source: Download file again? (%1$s)
am: ፋይል እንደገና ይውረድ? (%1$s)

source: Download files and read and modify the browser’s download history
am: ፋይሎችን ያውርዱ እና የአሳሹን የማውረድ ታሪክ ያንብቡ እና ያሻሽሉ

source: Download file with:
am: ፋይል አውርድ በ፡-

source: Downloading and verifying add-on…
am: ተጨማሪን በማውረድ እና በማረጋገጥ ላይ…

source: Downloading and verifying extension…
am: ቅጥያ በማውረድ እና በማረጋገጥ ላይ…

source: Download in progress…
am: ማውረድ በሂደት ላይ…

source: Download language in data saving mode (%1$s)?
am: ቋንቋ በውሂብ ቆጣቢ ሁነታ (%1$s) ይውረድ?

source: Download languages
am: ቋንቋዎችን አውርድ

source: Download Languages
am: ቋንቋዎችን አውርድ

source: Download link
am: አገናኙን አውርድ

source: Download paused
am: ማውረድ ባለበት ቆሟል

source: Downloads
am: የወረዱ

source: Downloads Removed
am: ውርዶች ተወግደዋል

source: Download while in data saving mode (%1$s)?
am: በውሂብ ቆጣቢ ሁነታ (%1$s) ላይ እያለ ይውረድ?

source: Do you want to leave this site? Data you have entered may not be saved
am: ከዚህ ድረ-ገፅ መውጣት ይፈልጋሉ? ያስገቡት ውሂብ ላይቀመጥ ይችላል

source: %d page
am: %d ገጽ

source: %d pages
am: %d ገጾች

source: Drag from top & press back to exit
am: ከላይ ይጎትቱ እና ለመውጣት ወደ ኋላ ምልክትን ይጫኑ

source: Drag from top & use back gesture to exit
am: ከላይ ይጎትቱ እና ለመውጣት የእጅ ምልክት ይጠቀሙ

source: DRM-controlled content
am: በDRM ቁጥጥር የሚደረግበት ይዘት

source: %d site
am: %d ድረ-ገፅ

source: %d sites
am: %d ድረ-ገፅ

source: %d tab
am: %d ትር

source: %d tabs
am: %d ትሮች

source: %d tab selected
am: %d ትር ተመርጧል

source: %d tabs selected
am: %d ትሮች ተመርጠዋል

source: Duplicate tab
am: ትርን አባዛ

source: EDIT
am: አርትዕ

source: Edit address
am: አድራሻ አርትዕ

source: Edit bookmark
am: እልባት አርትዕ

source: Edit card
am: ካርድ ያርትዑ

source: Edit engines visible in the search menu
am: በፍለጋ ምናሌው ውስጥ የሚታዩ ፍርግሞችን ያርትዑ

source: Edit folder
am: አቃፊ አርትዕ

source: Edit login
am: መግቢያ አርትዕ

source: Edit password
am: የይለፍ ቃል አርትዕ

source: Edit search engine
am: የፍለጋ ፍርግሞችን ያርትዑ

source: Edit shortcut
am: አቋራጭ አርትዕ

source: Email address copied to clipboard
am: የኢሜል አድራሻ ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: Email with…
am: ኢሜይል በ…

source: Enabled
am: ነቅቷል

source: Enable Gecko logs
am: የGecko ምዝግብ ማስታወሻዎችን አንቃ

source: Enable in all tabs
am: በሁሉም ትሮች ውስጥ አንቃ

source: Enable only in private tabs
am: በግል ትሮች ውስጥ ብቻ አንቃ

source: Enable private browsing
am: የግል አሰሳን አንቃ

source: Enable private tabs screen lock
am: የግል ትሮች የማያ ገጽ መቆለፊያን አንቃ

source: Enables fingerprinting protection to stop suspected fingerprinters.
am: ጣት አሻራ ጥበቃን የተጠረጠሩ የጣት አሻራ ሰብሳቢዎችን ለማስቆም ያስችላል።

source: Enable telemetry to send data.
am: ውሂብ ለመላክ ቴሌሜትሪ ያንቁ።

source: Enable to allow pinch and zoom, even on websites that prevent this gesture.
am: ይህን የእጅ ምልክት በሚከለክሉ ድረ-ገጾች ላይ እንኳን መቆንጠጥ እና ማጉላትን መፍቀድ ያንቁ።

source: Engines visible on the search menu
am: በፍለጋ ምናሌው ውስጥ የሚታዩ ፍርግሞች

source: Enhanced Tracking Protection
am: የተሻሻለ የክትትል ጥበቃ

source: Enhanced tracking protection exception preference icon
am: የተሻሻለ የመከታተያ ጥበቃ ልዩ ምርጫ አዶ

source: Enhanced Tracking Protection is off for these websites
am: ለእነዚህ ድረ-ገፆች የተሻሻለ የመከታተያ ጥበቃ ጠፍቷል

source: Enjoy quicker navigation that’s always at your fingertips.
am: ሁልጊዜ ጣትዎ ጫፍ ላይ ባለው ፈጣን አሰሳ ይደሰቱ።

source: Enter a password
am: የይለፍ ቃል ያስገቡ

source: Enter a search string
am: የፍለጋ ሕብረቁምፊ ያስገቡ

source: Enter a username
am: የተጠቃሚ ስም ያስገቡ

source: Enter a valid card number
am: የሚሰራ ካርድ ቁጥር ያስገቡ

source: Enter a valid URL
am: የሚሰራ URL ያስገቡ

source: Enter a web address
am: የድር አድራሻ ያስገቡ

source: Entering full screen mode
am: ወደ ሙሉ ማያ ገጽ ሁነታ በመግባት ላይ

source: Enter search engine name
am: የፍለጋ ፍርግም ስም ያስገቡ

source: Enter search terms
am: የፍለጋ ቃላትን አስገባ

source: Erase browsing history
am: የአሰሳ ታሪክን አጥፋ

source: Error Code: NS_ERROR_OFFLINE
am: የስህተት መለያ፡ NS_ERROR_OFFLINE

source: Error connecting to “%s”
am: ከ "%s" ጋር መገናኘት ላይ ስህተት

source: Everything
am: ሁሉም ነገር

source: Exceeded the maximum number of tabs (%1$s) that can be generated in one operation
am: በአንድ ክወና ውስጥ ሊፈጠሩ ከሚችሉት ከፍተኛው የትሮች ብዛት (%1$s) አልፏል

source: Exceptions
am: ልዩ ሁኔታዎች

source: Exceptions let you disable tracking protection for selected sites.
am: ልዩ ሁኔታዎች ለተመረጡት ድረ-ገፆች የመከታተያ ጥበቃን እንዲያሰናክሉ ያስችልዎታል።

source: Exchange messages with apps other than this one
am: ከሌላ መተግበሪያዎች ጋር መልዕክቶችን ይለዋወጡ

source: Exit multiselect mode
am: ከብዙ ምርጫ ሁነታ ውጣ

source: expand
am: ዘርጋ

source: expanded
am: ተዘርግቷል

source: Expanded
am: ዝርግ

source: Expand group of synced tabs
am: የተመሳሰሉ ትሮችን ቡድን ዘርጋ

source: Expand inactive tabs
am: የቦዘኑ ትሮችን ዘርጋ

source: Expand saved addresses
am: የተቀመጡ አድራሻዎችን ዘርጋ

source: Expand saved cards
am: የተቀመጡ ካርዶችን ዘርጋ

source: Expand saved passwords
am: የተቀመጡ የይለፍ ቃሎችን ዘርጋ

source: Expand suggested addresses
am: የተጠቆሙ አድራሻዎችን ዘርጋ

source: Expand suggested credit cards
am: የተጠቆሙ ክሬዲት ካርዶችን ዘርጋ

source: Expand suggested logins
am: የተጠቆሙ መግቢያዎችን ዘርጋ

source: Expiration Date
am: የሚያበቃበት ቀን

source: Expiration Date Month
am: የሚያበቃበት ወር

source: Expiration Date Year
am: የሚያበቃበት ዓመት

source: Explore add-ons
am: ተጨማሪዎችን ያስሱ

source: Explore extensions
am: ቅጥያዎችን ያስሱ

source: Explore more extensions
am: ተጨማሪ ቅጥያዎችን ያስሱ

source: Explore more extensions.
am: ተጨማሪ ቅጥያዎችን ያስሱ።

source: Explore more wallpapers
am: ተጨማሪ ልጣፎችን ያስሱ

source: Extend developer tools to access your data in open tabs
am: በክፍት ትሮች ውስጥ ውሂብዎን ለመድረስ የገንቢ መሳሪያዎችን ዘርጋ

source: Extension collection modified. Quitting the application to apply changes…
am: የቅጥያ ስብስብ ተስተካክሏል። ለውጦችን ለመተግበር መተግበሪያውን በማቆም ላይ…

source: Extensions
am: ቅጥያዎች

source: Extensions are temporarily disabled
am: ቅጥያዎች ለጊዜው ተሰናክለዋል

source: Extensions level up your browsing, from changing how %s looks and performs to boosting privacy and safety.
am: ቅጥያዎች የአሰሳዎን ደረጃ ከፍ ያደርጋሉ፣ %s ምን እንደሚመስል እና እንዴት እንደሚሰራ ከመቀየር ጀምሮ እስከ ግላዊነትን እና ደህንነትን ማሳደግ ድረስ።

source: Extensions Manager
am: የቅጥያዎች ማስተዳደሪያ

source: Extensions, navigate up
am: ቅጥያዎች፣ ወደ ላይ ዳስስ

source: Extension updates
am: የቅጥያ ዝማኔዎች

source: External download manager
am: የውጭ ማውረድ አስተዳዳሪ

source: Failed to disable %1$s
am: %1$sን ማሰናከል አልተሳካም

source: Failed to enable %1$s
am: %1$sን ማንቃት አልተሳካም

source: Failed to install %1$s
am: %1$sን መጫን አልተሳካም

source: Failed to install this add-on.
am: ይህን ተጨማሪ መጫን አልተሳካም።

source: Failed to install this extension.
am: ይህን ቅጥያ መጫን አልተሳካም።

source: Failed to query Add-ons!
am: ተጨማሪዎችን መጠየቅ አልተሳካም!

source: Failed to query Extensions!
am: ቅጥያዎችን መጠየቅ አልተሳካም!

source: Failed to remove %1$s
am: %1$sን ማስወገድ አልተሳካም

source: Failed to uninstall %1$s
am: %1$sን ማራገፍ አልተሳካም

source: Fast and secure web browsing
am: ፈጣን እና ደህንነቱ የተጠበቀ የድር አሰሳ

source: Fast and secure web browsing.
am: ፈጣን እና ደህንነቱ የተጠበቀ የድር አሰሳ።

source: Featuring Total Cookie Protection to stop trackers from using cookies to stalk you across sites.
am: ተከታታዮች እርስዎን በድረ-ገጾች ላይ ለማሳደድ ኩኪዎችን እንዳይጠቀሙ ለማቆም አጠቃላይ የኩኪ ጥበቃን በማሳየት ላይ።

source: Feb
am: የካ

source: File Not Found
am: ሰነዱ አልተገኘም

source: Files and media permission access needed to download files. Go to Android settings, tap permissions, and tap allow.
am: ፋይሎችን ለማውረድ የፋይሎች እና የሚዲያ መዳረሻ ፍቃድ ያስፈልጋል። ወደ አንድሮይድ ቅንብሮች ይሂዱ፣ ፈቃዶችን ይንኩ እና ፍቀድን ይንኩ።

source: Files you download will appear here.
am: ያወረዷቸው ፋይሎች እዚህ ይታያሉ።

source: Fill and save usernames and passwords in websites while using %1$s.
am: %1$s በሚጠቀሙበት ጊዜ የተጠቃሚ ስሞችን እና የይለፍ ቃሎችን በድረ-ገፆች ውስጥ ይሙሉ እና ያስቀምጡ።

source: Fill link from clipboard
am: አገናኙን ከቅንጥብ ሰሌዳ ይሙሉ

source: Fill usernames and passwords in other apps on your device.
am: በመሳሪያዎ ላይ ባሉ ሌሎች መተግበሪያዎች ውስጥ የተጠቃሚ ስሞችን እና የይለፍ ቃላትን ይሙሉ።

source: financial and payment information
am: የፋይናንስ እና የክፍያ መረጃ

source: Find in page
am: በገጽ ውስጥ ያግኙ

source: Find in page…
am: በገጽ ውስጥ ያግኙ…

source: Find more add-ons
am: የበለጠ ተጨማሪዎችን ያግኙ

source: Find more extensions
am: ተጨማሪ ቅጥያዎችን ያግኙ

source: Find next result
am: የሚቀጥለውን ውጤት ያግኙ

source: Find out if you can trust this product’s reviews — before you buy.
am: ከመግዛትዎ በፊት — የዚህን ምርት ግምገማዎች ማመን እንደሚችሉ ይወቁ።

source: Find out why millions love Firefox
am: ሚሊዮኖች ለምን Firefoxን እንደሚወዱ ይወቁ

source: Find previous result
am: ያለፈውን ውጤት ያግኙ

source: Find something nearby. Or discover something fun.
am: በአቅራቢያ ያለን ነገር ይፈልጉ። ወይም ዘና የሚያደርግ ነገር ይወቁ።

source: Find what you need faster, from private browsing to save actions.
am: ከግል አሰሳ እስከ ማስቀመጥ ድርጊቶች ድረስ፣ የሚፈልጉትን በፍጥነት ያግኙ።

source: Fingerprinters
am: የአሳሽ አሻራ መከታተያዎች

source: Finish setting up %1$s
am: %1$sን ማዋቀር ይጨርሱ

source: Firefox Account
am: የፋየርፎክስ መለያ

source: Firefox Account/Sync server modified. Quitting the application to apply changes…
am: የፋየርፎክስ መለያ/አመሳስል አገልጋይ ተቀይሯል። ለውጦችን ለማካተት መተግበሪያውን በማቆም ላይ…

source: Firefox add-on technology is modernizing. These add-ons use frameworks that are not compatible with Firefox 75 & beyond.
am: የፋየርፎክስ ተጨማሪ ቴክኖሎጂ በመዘመን ላይ ነው። እነዚህ ተጨማሪዎች ከፋየርፎክስ 75 እና ከዚያ በታች ጋር ተኳሃኝ ያልሆኑ ማዕቀፎችን ይጠቀማሉ።

source: Firefox can close tabs you haven’t viewed over the past month.
am: Firefox ባለፈው ወር ውስጥ ያላዩዋቸውን ትሮች ሊዘጋ ይችላል።

source: Firefox cares about your privacy. Learn more in our %1$s.
am: ፋየርፎክስ የእርስዎን ግላዊነት ያስባል። በእኛ %1$s ውስጥ የበለጠ ይወቁ።

source: Firefox cares about your privacy. Read more in our %1$s.
am: Firefox የእርስዎን ግላዊነት ያስባል። በእኛ %1$s ውስጥ የበለጠ ያንብቡ።

source: Firefox encrypts your passwords, bookmarks, and more when you’re synced.
am: Firefox በሚያመሳሰሉበት ጊዜ የእርስዎን የይለፍ ቃላት፣ ዕልባቶች እና ሌሎችንም ያመሰጥራቸዋል።

source: Firefox gives you control over what you share online and what you share with us.
am: ፋየርፎክስ በመስመር ላይ ምን እንደሚያጋሩ እና ከእኛ ጋር ምን እንደሚያጋሩ እንዲቆጣጠሩ ያስችልዎታል።

source: Firefox is fast and private
am: Firefox ፈጣን እና ግላዊ ነው

source: Firefox logo
am: የFirefox አርማ

source: Firefox privacy notice
am: የFirefox ግላዊነት ማስታወቂያ

source: Firefox puts people over profits and defends your privacy by blocking cross-site trackers. Learn more in our privacy notice.
am: ፋየርፎክስ ሰዎችን ከትርፍ በላይ ያስቀድማል እና ድረ-ገጽ ተሻጋሪ መከታተያዎችን በማገድ የእርስዎን ግላዊነት ይጠብቃል። በግላዊነት ማስታወቂያችን ውስጥ የበለጠ ይረዱ።

source: Firefox Suggest
am: የፋየርፎክስ ጥቆማ

source: Firefox Terms of Use
am: የፋየርፎክስ የአጠቃቀም ውል

source: First Name
am: የመጀመሪያ ስም

source: FOLDER
am: አቃፊ

source: Follow device language
am: የመሣሪያ ቋንቋን ተከተል

source: Follow device theme
am: የመሳሪያውን ገጽታ ተከተል

source: Font Size
am: የቅርጸ ቁምፊ መጠን

source: Font size decrease
am: የቅርጸ ቁምፊ መጠን ይቀንሳል

source: Font size increase
am: የቅርጸ ቁምፊ መጠን መጨመር

source: Font size will match your Android settings. Disable to manage font size here.
am: የቅርጸ-ቁምፊ መጠን ከእርስዎ Android ቅንብሮች ጋር ይዛመዳል። የቅርጸ ቁምፊ መጠንን እዚህ ለማስተዳደር ያሰናክሉ።

source: Forward
am: አስተላልፍ

source: For your privacy, translations never leave your device. New languages and improvements coming soon! %1$s
am: ለግላዊነትዎ፣ ትርጉሞች ከመሳሪያዎ አይወጡም። አዲስ ቋንቋዎች እና ማሻሻያዎች በቅርቡ ይመጣሉ! %1$s

source: Frees up storage space
am: የማከማቻ ቦታን ያስለቅቃል

source: Front-facing camera
am: የፊት ካሜራ

source: Full screen site controls
am: የሙሉ ማያ ገጽ መቆጣጠሪያዎች

source: Gathering crash data
am: የብልሽት ውሂብ በመሰብሰብ ላይ

source: Gathering crash telemetry data
am: የብልሽት ቴሌሜትሪ መረጃን በመሰብሰብ ላይ

source: Gestures
am: የእጅ ምልክቶች

source: Get data from the clipboard
am: ከቅንጥብ ሰሌዳው ውሂብ ያግኙ

source: Get started
am: ይጀምሩ

source: Get suggestions from the web related to your search
am: ከድር ፍለጋዎ ጋር የተያያዙ ጥቆማዎችን ያግኙ

source: Glean Debug Tools
am: Glean ማረም መሳሪያዎች

source: Go Back (Recommended)
am: ተመለስ (የሚመከር)

source: Golden Hour
am: ወርቃማ ሰዓት

source: Google Search
am: የጉግል ፍለጋ

source: Got it
am: ገባኝ

source: Go to settings
am: ወደ ቅንብሮች ይሂዱ

source: Go to Settings
am: ወደ ቅንብሮች ይሂዱ

source: Grab tabs and passwords from your other devices to pick up where you left off.
am: ካቆሙበት ለመቀጠል ከሌሎች መሳሪያዎችዎ ትሮችን እና የይለፍ ቃሎችን ይያዙ።

source: Gradients
am: ቅልቅል ቀለሞች

source: Great start! You’ve completed 1 out of 3 steps.
am: ጥሩ ጅምር! ከ3 ደረጃዎች 1 ጨርሰዋል።

source: Great start! You’ve completed 1 out of 6 steps.
am: ጥሩ ጅምር! ከ6 ደረጃዎች 1 ጨርሰዋል።

source: Green
am: አረንጓዴ

source: Grid
am: ሰንጠረዥ

source: Group deleted
am: ቡድን ተሰርዟል

source: Harmful site issue
am: ጎጂ የድረ-ገፅ ጉዳይ

source: health information
am: የጤና መረጃ

source: Helpful tools
am: አጋዥ መሳሪያዎች

source: Help make %1$s better for everyone. Mozilla employees use the info you send to fix website problems.
am: %1$s ለሁሉም ሰው የተሻለ እንዲሆን ያግዙ። የMozilla ሰራተኞች የድረ-ገጽ ችግሮችን ለማስተካከል የላኩትን መረጃ ይጠቀማሉ።

source: Help make printing in Firefox better. It only takes a sec
am: በFirefox ማተምን የተሻለ ለማድረግ ያግዙ። አንድ ሰከንድ ብቻ ነው የሚወስደው

source: Help make search in Firefox better. It only takes a minute
am: በFirefox ውስጥ ፍለጋን የተሻለ ለማድረግ ያግዙ። አንድ ደቂቃ ብቻ ነው የሚወስደው

source: Help make sync in Firefox better. It only takes a minute
am: በFirefox ውስጥ ማመሳሰልን የተሻለ ለማድረግ ያግዙ። አንድ ደቂቃ ብቻ ነው የሚወስደው

source: Help us grow Firefox
am: ፋየርፎክስን እንድናሳድግ ይርዱን

source: Help us make Firefox better
am: Firefoxን የተሻለ እንድናደርግ ያግዙን

source: Help us make Firefox better. It only takes a minute.
am: Firefoxን የተሻለ እንድናደርግ ይርዱን። አንድ ደቂቃ ብቻ ነው የሚወስደው።

source: Hide and show browser tabs
am: የአሳሽ ትሮችን ደብቅ እና አሳይ

source: Hide password
am: የይለፍ ቃል ደብቅ

source: Highlighted
am: የተተኮረበት

source: Highlights from recent reviews
am: ከቅርብ ግዜ ግምገማዎች ዋና ዋናዎቹ

source: History
am: ታሪክ

source: History Deleted
am: ታሪክ ተሰርዟል

source: Homepage
am: መነሻ ገጽ

source: Homepage after four hours of inactivity
am: መነሻ ገጽ ከአራት ሰዓታት እንቅስቃሴ-አልባነት በኋላ

source: Home region
am: የቤት ክልል

source: Home screen
am: የመነሻ ማያ ገጽ

source: Hop from phone to laptop and back
am: ከስልክ ወደ ላፕቶፕ ይዝለሉ እና ይመለሱ

source: Hostname required
am: የአስተናጋጅ ስም ያስፈልጋል

source: However, it’s also possible that an attacker is involved. If you continue to the website, you should not enter any sensitive info. If you continue, HTTPS-Only mode will be turned off temporarily for the site.
am: ሆኖም፣ አጥቂው ተሳታፊ ሊሆን ይችላል። ወደ ድረ-ገጹ ከቀጠሉ ምንም አይነት ጥንቃቄ የሚሻ መረጃ ማስገባት የለብዎትም። ከቀጠሉ HTTPS-ብቻ ሁነታ ለጊዜው ለድረ-ገጹ ይጠፋል።

source: How reliable are these reviews?
am: እነዚህ ግምገማዎች ምን ያህል አስተማማኝ ናቸው?

source: How satisfied are you with printing in Firefox?
am: በFirefox ውስጥ በማተም ምን ያህል ረክተዋል?

source: How satisfied are you with the search experience in Firefox?
am: በFirefox ውስጥ ባለው የፍለጋ ልምድ ምን ያህል ረክተዋል?

source: How satisfied are you with the sync experience in Firefox?
am: በFirefox ውስጥ ባለው የማመሳሰል ልምድ ምን ያህል ረክተዋል?

source: How satisfied are you with your Firefox homepage?
am: በFirefox መነሻ ገጽዎ ምን ያህል ረክተዋል?

source: how %s by Mozilla determines review quality
am: %s በሞዚላ እንዴት የግምገማ ጥራት እንደሚወስን

source: how %s determines review quality
am: %s የግምገማ ጥራትን እንዴት እንደሚወስን

source: How we determine review quality
am: የግምገማ ጥራትን እንዴት እንደምንወስን

source: How we use the data
am: ውሂቡን እንዴት እንደምንጠቀም

source: HTTPS-Only Mode
am: HTTPS-ብቻ ሁነታ

source: I don’t use it
am: እኔ አልጠቀምበትም

source: I don’t use search on Firefox
am: ፍለጋን በFirefox አልጠቀምም

source: I don’t use sync
am: ማመሳሰልን አልጠቀምም

source: If allowed, private tabs will also be visible when multiple apps are open
am: ከተፈቀደ፣ ብዙ መተግበሪያዎች ሲከፈቱ የግል ትሮችም ይታያሉ

source: If something looks broken on this site, try turning off protections.
am: በዚህ ጣቢያ ላይ የሆነ ነገር የተሰበረ ከመሰለ፣ ጥበቃዎችን በማጥፋት ይሞክሩ።

source: If you close all Private tabs now, %1$s download will be canceled. Are you sure you want to leave Private Browsing?
am: ሁሉንም የግል ትሮችን አሁን ከዘጉ፣ %1$sን ማውረድ ይሰረዛል። እርግጠኛ ነዎት ከግል አሰሳ መውጣት ይፈልጋሉ?
